{
  "versions": [
    {
      "version": "2.1.1-alpha",
      "date": "2026-02-03",
      "title": "WIP: Página inicial",
      "summary": "Criação de página inicial em desenvolvimento",
      "features": [
        "Criação de página inicial.",
        "Implementação de React Router Dom para cada página ter uma URL única."
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": []
    },
    {
      "version": "2.1.0-beta",
      "date": "2026-01-15",
      "title": "Novas funções para dados de sondagens",
      "summary": "Exportação AGS e Ignorar páginas",
      "features": [
        "Exportação de dados no formato AGS.",
        "Seleção de páginas do PDF para serem ignoradas na extração de dados."
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": []
    },
    {
      "version": "2.1.0-alpha",
      "date": "2026-01-13",
      "title": "Exportação AGS e Ignorar páginas",
      "summary": "Exportação AGS e Ignorar páginas",
      "features": [
        "Exportação no formato AGS",
        "Modal de selecionar páginas para serem excluídas"
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": []
    },
    {
      "version": "2.0.2-beta",
      "date": "2025-12-10",
      "title": "Patch de correções",
      "summary": "Melhorias na geração de palitos e na extração de NSPT.",
      "features": [],
      "improvements": [
        "Processamento de NSPTs na extração de dados do PDF agora aceita o caractere '>' e as expressões 'PM' e 'PH'",
        "Melhorias na edição de NSPT na página de geração de palitos de sondagem"
      ],
      "bugfixes": [
        "Correção de alinhamento nos cabeçalhos nos palitos de sondagem gerados nos modelos JS",
        "Correção no posicionamento NSPT na geração de palitos de sondagem"
      ],
      "known_issues": []
    },
    {
      "version": "2.0.1-beta",
      "date": "2025-11-28",
      "title": "Patch conversão de XLSX para KML/KMZ",
      "summary": "Correção de erros na conversão de coordenadas.",
      "features": [],
      "improvements": ["Inclusão de arquivos de exemplo para download"],
      "bugfixes": [
        "Correção de erro que travava o site na ferramenta de conversão de XLSX para KML/KMZ ao tentar converter valores inválidos. Agora o programa avisa do erro e processa apenas os pontos válidos."
      ],
      "known_issues": []
    },
    {
      "version": "2.0.0-beta",
      "date": "2025-11-10",
      "title": "OpenGeo beta - Ferramentas CAD/SIG",
      "summary": "Versão beta das ferramentas CAD/SIG.",
      "features": [
        "Processamento de DXF com sondagens em blocos atributáveis ou multileader para exportação dos dados como KML, KMZ ou XLSX",
        "Renomear pontos de sondagem em arquivos DXF de acordo com camadas do arquivo.",
        "Transformação de planilhas em XLSX com dados de pontos em arquivos KML ou KMZ",
        "Extração de dados de KML/KMZ para planilha em XLSX",
        "Criação de perfil em DXF a partir de planilha em XLSX com distâncias dos pontos de sondagem.",
        "Medição de distâncias em arquivos DXF de pontos de sondagem (bloco atributável ou multileader) para uma polyline."
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": []
    },
    {
      "version": "2.0.0-alpha",
      "date": "2025-10-08",
      "title": "OpenGeo alpha - Ferramentas CAD/SIG",
      "summary": "Implementação de novas funções para geração de palitos.",
      "features": [
        "Processamento de DXF com sondagens em blocos atributáveis ou multileader",
        "Exportação de dados de sondagem para XSLX",
        "Exportação de dados de sondagem para KML e KMZ",
        "Ferramenta de renomear sondagens de acordo com camadas do DXF, seguindo a ordem da direção cardinal escolhida pelo usuáio"
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": []
    },
    {
      "version": "1.1.0-beta",
      "date": "2025-10-03",
      "title": "JS OpenGeo beta",
      "summary": "Implementação de novas funções para geração de palitos.",
      "features": [
        "Importar CSV no formato Leapfrog para gerar palitos",
        "Alterar NSPT inicial em todas as sondagens",
        "Adição de novos padrões de palitos",
        "Releases de versões anteriores podem ser acessadas pela página de histórico de versões"
      ],
      "improvements": [],
      "bugfixes": [
        "Permitir início e conclusão da seleção de área clicando em cima de uma área existente."
      ],
      "known_issues": [
        "OCR apresenta dados pouco confiáveis para NSPT e profundidades",
        "Edições de dados para geração do palitos podem criar resultados inesperados"
      ]
    },
    {
      "version": "1.0.0-beta",
      "date": "2025-09-08",
      "title": "JS OpenGeo beta",
      "summary": "Esta primeira versão marca o lançamento do beta do JS OpenGeo, trazendo as funções de extrair dados de PDFs, processar dados de sondagens e gerar palitos dessas sondagens.",
      "features": [
        "Upload simultâneo de múltiplos PDFs",
        "Extração de texto a partir de elementos de texto do PDF ou de OCR (Optical Character Recognition)",
        "Criação de áreas para extração de texto",
        "Processamento condicional de dados de sondagens",
        "Exportação dos dados em múltiplos formatos",
        "Visualização das sondagens em mapa e download de KMZ",
        "Geração de palitos de sondagem a partir dos dados extraídos ou de JSON com o padrão do JS OpenGeo",
        "Edição de dados permitindo correções antes da geração dos palitos"
      ],
      "improvements": [],
      "bugfixes": [],
      "known_issues": [
        "OCR apresenta dados pouco confiáveis para NSPT e profundidades",
        "Edições de dados para geração do palitos podem criar resultados inesperados"
      ]
    }
  ]
}
